app/controllers/autors_controller.rb

  def index

    @qbe_index = Autor.new(params[:autor])

    params.each do |key, value|
      if @qbe_index.attribute_names().include?(key)
         if not value.blank?
          if @select_buff_index.nil?
            @select_buff_index =  key + " like " + "'" + value + "%'"
            @qbe_index[key] = value
          else
            @select_buff_index = @select_buff_index + " and " + key + " like " + "'" + value + "%'"
            @qbe_index[key] = value
          end
        end
      end
    end

    lineas_por_pagina = 5
    sort = case params['sort']
           when "id"  then "id"
           when "nombre"  then "nombre"
           when "fecha"  then "fecha"
           when "id_reverse"  then "id DESC"
           when "nombre_reverse"  then "nombre DESC"
           when "fecha_reverse"  then "fecha DESC"
           end


    if  not @select_buff_index.nil?
      @autors = Autor.paginate :page => params[:page], :per_page => lineas_por_pagina,  :order => sort, :conditions =>  @select_buff_index
---
SELECT * FROM `autors` WHERE (nombre like '5%') ORDER BY id ASC LIMIT 0, 7
SELECT count(*) AS count_all FROM "autors" WHERE (nombre like 'e%')

  def show
    @autor = Autor.find(params[:id])

    lineas_por_pagina = 5
    sort = case params['sort']
           when "titulo_id"  then "id"
           when "titulo_nombre"  then "nombre"
           when "titulo_fecha"  then "fecha"
           when "titulo_id_reverse"  then "id DESC"
           when "titulo_nombre_reverse"  then "nombre DESC"
           when "titulo_fecha_reverse"  then "fecha DESC"
           end

    @titulos = Titulo.paginate :page => params[:page], :per_page => lineas_por_pagina, :order => sort,
                               :conditions => " autor_id = " + params[:id]
---
SELECT * FROM `autors` WHERE (`autors`.`id` = 1)
SELECT * FROM "titulos" WHERE ( autor_id = 2) ORDER BY nombre DESC LIMIT 5 OFFSET 0
SELECT count(*) AS count_all FROM "titulos" WHERE ( autor_id = 2)

  def edit
    @autor = Autor.find(params[:id])
---
SELECT * FROM `autors` WHERE (`autors`.`id` = 1)

  def create
    @autor = Autor.new(params[:autor])

    respond_to do |format|
      if @autor.save
---
INSERT INTO `autors` (`fecha`, `updated_at`, `nombre`, `created_at`) VALUES('2010-04-28', '2010-04-29 02:07:28', 'Luis Capriles', '2010-04-29 02:07:28')

  def update
    @autor = Autor.find(params[:id])

    respond_to do |format|
      if @autor.update_attributes(params[:autor])
---
SELECT * FROM `autors` WHERE (`autors`.`id` = 3)
UPDATE `autors` SET `nombre` = 'Pedro Perez Dos', `updated_at` = '2010-04-29 22:19:40' WHERE `id` = 3

  def destroy
    @autor = Autor.find(params[:id])
    @autor.destroy
---
SELECT * FROM "autors" WHERE ("autors"."id" = 8)
DELETE FROM "autors" WHERE "id" = 8

  def auto_complete_for_autor_nombre
    @autors = Autor.find(:all, :conditions=> "nombre like "+ "'"+ params[:autor] [:nombre] + "%'")
---
SELECT * FROM "autors" WHERE (nombre like 'a%' or nombre like 'A%')