app/controllers/titulos_controller.rb

  def index

    @qbe_index = Titulo.new(params[:titulo])

    params.each do |key, value|
      if @qbe_index.attribute_names().include?(key)
         if not value.blank?
          if @select_buff_index.nil?
            @select_buff_index =  key + " like " + "'" + value + "%'"
            @qbe_index[key] = value
          else
            @select_buff_index = @select_buff_index + " and " + key + " like " + "'" + value + "%'"
            @qbe_index[key] = value
          end
        end
      end
    end

    lineas_por_pagina = 1
    sort = case params['sort']
           when "titulo_id"  then "id"
           when "titulo_nombre"  then "nombre"
           when "titulo_fecha"  then "fecha"
           when "titulo_id_reverse"  then "id DESC"
           when "titulo_nombre_reverse"  then "nombre DESC"
           when "titulo_fecha_reverse"  then "fecha DESC"
           end


    if  not @select_buff_index.nil?
      @titulos = Titulo.paginate :page => params[:page], :per_page => lineas_por_pagina, :order => sort, :conditions =>  @select_buff_index
---
SELECT * FROM "titulos" LIMIT 1 OFFSET 0
SELECT * FROM `titulos` ORDER BY id ASC LIMIT 0, 7
SELECT count(*) AS count_all FROM `titulos`

  def show
    @titulo = Titulo.find(params[:id])
---
SELECT * FROM "titulos" WHERE ("titulos"."id" = 25)

  def edit
    @titulo = Titulo.find(params[:id])
---
SELECT * FROM "titulos" WHERE ("titulos"."id" = 25)

  def create
    @titulo = Titulo.new(params[:titulo])

    respond_to do |format|
      if @titulo.save
---
INSERT INTO "titulos" ("nombre", "fecha", "autor_id", "created_at", "updated_at") VALUES('titulo 1 del autor 2', '2010-05-26', 2, '2010-05-05 20:36:24', '2010-05-05 20:36:24')

  def update
    @titulo = Titulo.find(params[:id])

    respond_to do |format|
      if @titulo.update_attributes(params[:titulo])
---
SELECT * FROM "titulos" WHERE ("titulos"."id" = 25)
UPDATE "titulos" SET "nombre" = 'Autor 5, Titulo 3', "updated_at" = '2010-07-22 20:20:31' WHERE "id" = 25

  def destroy
    @titulo = Titulo.find(params[:id])
    @titulo.destroy
---
SELECT * FROM "titulos" WHERE ("titulos"."id" = 29)
DELETE FROM "titulos" WHERE "id" = 29